#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	float f = 5.5f;
	//101.1
	//(-1)^0 * 1.011 * 2^2
	//S = 0
	//M = 1.011
	//E = 2    存储+127
	//0100 0000 10110000 00000000 00000000
	   //40 b0 00 00      

	return 0;
}

//浮点数存储的例子：

int main()
{
	int n = 9;
	  //0 00000000 00000000000000000001001
	  //E为全0
	  //E直接就是1-127 = -126
	  //M = 0.00000000000000000001001
	  //0.00000000000000000001001 * 2^-126
	  //
	float* pFloat = (float*)&n;

	printf("n的值为：%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//0.000000

	*pFloat = 9.0;
	  //1001.0
	  //(-1)^0 * 1.001*2^3
	  //S=0
	  //E = 3
	  //M = 1.001
	  //01000001000100000000000000000000
	printf("num的值为：%d\n", n);//1091567616
	printf("*pFloat的值为：%f\n", *pFloat);//9.000000

	return 0;
}

